In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("2_taxi_nyc.csv")

In [3]:
df.head(2)

,pickup_dt,pickup_month,borough,pickups,hday,spd,vsb,temp,dewp,slp,pcp 01,pcp 06,pcp 24,sd
0,2015-01-01 01:00:00,Jan,Bronx,152,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
1,2015-01-01 01:00:00,Jan,Brooklyn,1519,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0

In [12]:
df.groupby(["borough", "hday"], as_index=False)\
    .aggregate({"pickups":"sum"})

          borough hday   pickups
0           Bronx    N    212020
1           Bronx    Y      8027
2        Brooklyn    N   2233024
3        Brooklyn    Y     88011
4             EWR    N        98
5             EWR    Y         7
6       Manhattan    N  10027841
7       Manhattan    Y    340000
8          Queens    N   1289966
9          Queens    Y     53562
10  Staten Island    N      6707
11  Staten Island    Y       250

29101